[
    {
        "title": "POSITIONS FOR $800->$100k",
        "text": "Since yall can’t stop crying about my positions. I’ll post it now here lol. ",
        "id": "1jds90b",
        "upvotes": 275,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 254 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "https://preview.redd.it/v01kq61necpe1.png?width=1068&format=png&auto=webp&s=a7e05e7cb325b36689fa543591d88d4185aa65f0",
            "Once in a lifetime run.  Too bad you only started with $800.",
            "https://preview.redd.it/jn21peyydcpe1.png?width=382&format=png&auto=webp&s=7a62d35b8deb5795e8ac26cba2e42c73e20d40e8",
            "Bullying OP works. Good job, congrats, and fuck you.",
            "https://preview.redd.it/ctui5boxfcpe1.jpeg?width=393&format=pjpg&auto=webp&s=58492d9e35084dce5186c74b2242e8eb3a9566b6",
            "lemme hold $100k… I can flip it to $0k real quick bruh😇",
            "Great trades my dude!! I’ve never been happier to write a large check to the IRS",
            "This is where you wish this was a ROTH IRA.",
            "https://preview.redd.it/b04xubnpgcpe1.jpeg?width=280&format=pjpg&auto=webp&s=3dcbe4fbd6f935a253196d3a142588adbd0d6140"
        ],
        "created_at": "2025-03-17 20:20:15",
        "url": "https://www.reddit.com/gallery/1jds90b"
    },
    {
        "title": "Respect the dip, be the dip, BUY THE DIP! 😂🦍🚀",
        "text": "",
        "id": "1jdr0k7",
        "upvotes": 23,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 17 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "holy shit",
            "Short expiration window. Wouldn't be able to sleep at night but good luck. Also the dip was last week",
            "one of the trades of all time",
            "Uh.....pass but you do that.",
            "Can you explain your thought process? Your MicroStrategy if you will ![img](emote|t5_2th52|4640)",
            "Mane wtf",
            "Are you going to post the potential loss?",
            "Be the dipshit I'm on it!",
            "Quit MSTR baiting."
        ],
        "created_at": "2025-03-17 19:23:16",
        "url": "https://i.redd.it/9t1gmma13cpe1.jpeg"
    },
    {
        "title": "Btc price prediction",
        "text": "You guys always say show positions so i am from the get go, but im just curious as to what your guys price predictions are for btc this week, im short on btc spot etf $IBIT. In predicting a drop to 70-73k area by wendsday(peak of 2024 bull run)(gap most likely will be filled). If you guys could give your input that would be great",
        "id": "1jdpk0s",
        "upvotes": 0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 11 months ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Tomorrow Mr Dealmaker talking peace deal with Putin \n\nUp or down nobody knows",
            "You're predicting a 13% drop in BTC by Wednesday?",
            "You're predicting a violent crash from 84k to 74k? In two days? What is your reasoning for that",
            "![img](emote|t5_2th52|18630)",
            "Why?",
            "I have no idea but hope your right.",
            "Btc $1mil eow",
            "So many lines on that graph. I'm gonna cum.",
            "Yeah, TA doesn’t really work well with BTC on longer time frames.\n\nedit: doesn’t work."
        ],
        "created_at": "2025-03-17 18:19:02",
        "url": "https://www.reddit.com/gallery/1jdpk0s"
    },
    {
        "title": "Google in Fresh Talks to Buy Cybersecurity Startup Wiz for $30 Billion",
        "text": "",
        "id": "1jdp3ug",
        "upvotes": 215,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 55 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Again?",
            "I'm calling bs, wiz CEO probably just wants to bait msft to make a bid.",
            "Nobody beats the Wiz!",
            "Lol looks like wiz chickened out going public, don’t blame them with everyday bringing new bullshit to the market.",
            "alternative source:\n\n[https://www.bloomberg.com/news/articles/2025-03-17/alphabet-in-talks-to-buy-cloud-security-firm-wiz-for-33-billion](https://www.bloomberg.com/news/articles/2025-03-17/alphabet-in-talks-to-buy-cloud-security-firm-wiz-for-33-billion)\n\n> Alphabet Inc. is in talks to purchase the cloud security company Wiz for $33 billion, restarting deal discussions that were called off last summer after extended negotiations, according to people familiar with the matter. \n\n> The deal, which could be announced as soon as Tuesday, would bolster the cybersecurity offerings for Alphabet’s Google Cloud and provide it with a crucial marketing boost to compete against its larger cloud competitors, Amazon.com Inc.’s Amazon Web Services and Microsoft Corp.’s Azure.\n\n> For Wiz, the deal represents a reversal after the company turned down Alphabet’s $23 billion offer last July, sticking instead with a plan to remain independent and eventually pursue an initial public offering. Wiz and its investors balked at the deal in part because of worries of a protracted regulatory approval process, with competition authorities in the US and Europe focusing on the tech sector for its economic sway and market power. \n\n> Chief Executive Officer Assaf Rappaport, who described last year’s offer as “humbling,” also said he relished the idea of growing Wiz into an independent cybersecurity giant, to compete against the likes of CrowdStrike Holdings Inc. and Palo Alto Networks.\n\n> Started by Israelis and based in New York, Wiz’s investors include Sequoia Capital, Index Ventures, Insight Partners and Cyberstarts. Last year, the company was valued at $12 billion in a funding round.",
            "Lina khan is no longer running the FTC so this deal would actually have a chance.",
            "But Reddit IPOed for 6 billon, got it",
            "Cake wasn't bigger?",
            "Google drops another 20%\n\n\nIm sooooo tired"
        ],
        "created_at": "2025-03-17 17:59:58",
        "url": "https://www.wsj.com/business/deals/alphabet-back-in-deal-talks-for-cybersecurity-startup-wiz-41cd3090"
    },
    {
        "title": "It’s not much but it’s honestly work",
        "text": "Playing with fire over here.",
        "id": "1jdnekp",
        "upvotes": 17,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 1404 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "It's not really work, it's just the power to charm.",
            "That naked bro?",
            "Now stop it",
            "Eventually you'll burn your hand",
            "Charm like options charm?"
        ],
        "created_at": "2025-03-17 16:49:23",
        "url": "https://i.redd.it/d8dyqs1lbbpe1.jpeg"
    },
    {
        "title": "BRKB OTM Leaps profit - easy swinging",
        "text": "First time posting gains, I bought BRKB as soon as I read about their cash hoard and how they sold most of their stocks. I went with as far dated and max OTM when I purchased initially 690c was the furthest out, strategy is just buy on red days then wait for a really Green Day to dump.\n\nIf you go look at the option chain 91 of the 93 volume sold today on Robinhood is from me lol just take advantage of people trying to chase when you get in around 8 dumping that all around 11 can be a sizeable profit now I can wait and buy bit by bit more again if I want when hype is lower and IV isn’t expanding. Went super long dated as essentially leveraged shares lower risk. \n\nMy plan is to keep swinging this gradually and build cash hoard to wait for the recession bottom and go long on SPY and big tech Leaps when Fed starts cutting rates. ",
        "id": "1jdl847",
        "upvotes": 24,
        "comments": [
            "nice![gif](emote|free_emotes_pack|money_face)",
            "Do you think buying the same 690 calls for Jan 16 2026 is worth it? They're for 158 premium.",
            "![img](emote|t5_2th52|31224)",
            "welp now i know where my next paycheck is going",
            "These type of options have poor liquidity so you kinda need to scalp the bid-ask, you can get the best entry point on a red day so I’d wait for that. You also have to remember Buffet is 94, so that’s part of the reason I was looking for an exit point. This is a ticking time bomb in a sense even if Berkshire would continue fine without him it’s gonna crash hard short term when that happens and that would also be a great time to go Long",
            "Thanks!",
            "By a red day, I assume a day that BRK.B is down which... doesn't seem to be happening this week lol\n\nMad I didn't buy more shares at $490.. I was like \"let me slowly go in and add on a dip\" WHOMP."
        ],
        "created_at": "2025-03-17 15:21:24",
        "url": "https://i.redd.it/n6q7cvuvvape1.jpeg"
    },
    {
        "title": "What Are Your Moves Tomorrow, March 18, 2025",
        "text": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1jdm4a3)",
        "id": "1jdm4a3",
        "upvotes": 183,
        "comments": [
            "#Ban Bet Lost\n\n/u/TeslaLeafBlower made a bet that TSLA would go to 288.0 within **22 hours** when it was 249.825 and it did not, so they were banned for a week.\n\nTheir record is now 1 wins and 141 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "I’m still waiting for a catalyst. Something tangible and real. Like a DFV post of a picture of a squirrel with a tiny pancake on it its head.",
            "BREAKING: Bol declare ber market has ended after 2 consecutive green days.",
            "Who bought RDDT at $140 then instantly lost -10% in an hour ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
            "$TSLA ![img](emote|t5_2th52|4271)",
            "Now watch this drive ⛳️ 🏌️‍♂️",
            "The crazy part is that Nostradamus predicted that SPY would close today at 567.05, 500 years ago.",
            "I don't even care the market was up today since tesla was down 5%![img](emote|t5_2th52|4271)",
            "I will hesitate to buy lunch at work but will drop god knows how much on options\n\nSee you degens tomorrow",
            "Your tax refund has been cancelled because it was signed by an autopen ![img](emote|t5_2th52|4258)"
        ],
        "created_at": "2025-03-17 15:57:32",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jdm4a3/what_are_your_moves_tomorrow_march_18_2025/"
    },
    {
        "title": "Am I Quandumb?",
        "text": "",
        "id": "1jdljm0",
        "upvotes": 50,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 6 days ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "i wish your father had used a quandom..",
            "Not at all.\nNow you have a License.",
            "jumped the gun my guy, you couldve gotten these at a discount tomorrow or wednesday lol",
            "maybe Jensen will save you during the quantum conference.... or maybe not, either way it's going to rocket down or up![img](emote|t5_2th52|4271)",
            "you might do okay on the $9 but $5/6 is greedy and dumb i guess that’s why you live in a lonely bedroom",
            "Not at all fellow Quantard! Join the club",
            "Quantum junk is going to sell off so hard after the Nvidia \"Quantum Day\" turns into the biggest dud in history. You're golden.",
            "I think $6/$9 put was a bit unrealistic M8. \n\nI went with $11P for QBTS and $8.50P QUBT, both for 90 days. QUBT is a fucking scam, and isn't going to be at the Nvidia conference 🤣 but people are pumping quantum. First sign of market volatility will prove me right.\n\nI'm going to dip at 15-20% profit and the Quantum fanboys can keep bagholding.",
            "I sold my Qbts Calls too early :("
        ],
        "created_at": "2025-03-17 15:34:25",
        "url": "https://i.redd.it/mh1a8ve7yape1.jpeg"
    },
    {
        "title": "God Bless RDDT volatility",
        "text": "",
        "id": "1jdl7th",
        "upvotes": 67,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 6 years ago\n**Total Comments** | 75 | **Previous Best DD** | \n**Account Age** | 17 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Where tf did this price spike even come from??",
            "Well it's back to red now",
            "I only took one. You got balls of steel.",
            "Nicely timed.",
            "Well played retard, well played ![img](emote|t5_2th52|8882)",
            "May start watching the RDDT chart for puts. I'm pretty pissed after I got auto-banned by a bot for talking bad about Elon.",
            "Rddt got smoked twice in 2 weeks",
            "You sold near the low of the day. Considering these are worth $800+/each right now which is more than double what you sold for, while you got lucky making money you played this extremely poorly.",
            "How big was your port before you dumped $80k into these puts? Because if your port is $80k you've got massive fucking balls.\n\n![img](emote|t5_2th52|4276)"
        ],
        "created_at": "2025-03-17 15:21:03",
        "url": "https://www.reddit.com/gallery/1jdl7th"
    },
    {
        "title": "Blew up my portfolio, hope it makes you feel better",
        "text": "https://preview.redd.it/ajqnuxd5pape1.png?width=800&format=png&auto=webp&s=eb533d052ce178c71f3661a658a51ed9a5c73ab3\n\nhttps://preview.redd.it/9urvkaj8pape1.png?width=1418&format=png&auto=webp&s=5d1d7b110a266408f245d6a42654a129c7509183\n\nSo yeah it kinda sucks, can't say it's life altering, I'm 27 and make good money in IT and have no expensive tastes in anything, if we combine all of my savings it's about 15% of it, and the whole reason I got into it is that the good ol' index funds in my pension and other accounts just felt like meaningless numbers on screen, and I went gambling knowing well that this money may be lost.\n\nHistory of this disaster:  \n60k -> 72k on lunr and other meme stocks(What's funny is that I cut my losses before the launch and even made a bit on puts)  \n72k -> 30k on lunr and other meme stocks(What's funny is that I cut my losses before the launch and even made a bit on puts)  \n30k-50k on puts  \n50k->almost nothing on puts\n\nDon't think I learned anything from it though, I will probably keep buying just spy shares until it will anger me that micro strategy pumps and then I'll port it 100% into puts (felt good \"profiting\" on that)",
        "id": "1jdktfm",
        "upvotes": 303,
        "comments": [
            "Just remember before buying the next put.. The market spends 70%+ of its time going up, regardless of what's happening in the world. You not only have to get the direction right, you have to get the timing right, so think of these odds and don't let the gains screenshots fool you. Good luck.",
            "Bruh you need to hedge your bets and trade w higher theta",
            "I'd say you have pretty expensive taste in puts my friend... They cost you a lot of money",
            "Just start investing into index funds again and do it for 35 more years and you will retire a millionaire \n\n\nOr keep chasing the sweet sweet high of a big win trading \n\nIt's up to you baby",
            "I mean sure blowing 70 grand on options gambling is fun and all, but have you considered maybe spending it on hookers and blow instead?",
            "![img](emote|t5_2th52|4267)",
            "try shares next  time",
            "At least I’m losing money on Tesla puts for a cause ![img](emote|t5_2th52|4271)",
            "You're young still. Plenty of time to recover and learn a pricey lesson or two.",
            "Thank you for your service in keeping the market up today.  The market will tank after your glorious puts expires."
        ],
        "created_at": "2025-03-17 15:05:17",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jdktfm/blew_up_my_portfolio_hope_it_makes_you_feel_better/"
    },
    {
        "title": "In December I told you guys Korea was undervalued. Everyone said buy US instead, because our government is more stable/predictable?",
        "text": "",
        "id": "1jdkrct",
        "upvotes": 281,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 7 years ago\n**Total Comments** | 1015 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/n75ynm/beware_the_index_reconstitution_process/) [x](https://www.reddit.com/r/wallstreetbets/comments/p86arc/lumn_the_technicals_and_fundamentals_align/) [x](https://www.reddit.com/r/wallstreetbets/comments/1i7r5cz/sk_hynix_just_posted_record_profits_due_the_ai/) [x](https://i.redd.it/07hlal4w0kfe1.png) \n**Account Age** | 11 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "https://preview.redd.it/5b0yncz9uape1.jpeg?width=1290&format=pjpg&auto=webp&s=42d58667f5195963cc168dde796eb20f8a9be44c",
            "Are we really posting 12% gains now? Really??",
            "Congrats! The stock market is a zero sum game. If “Everyone” says something take with a large grain of salt",
            "Didn't South Korea literally have an attempted coup like 3 months ago?!?! That hardly sounds \"stable\" LMAO",
            "For a second there...I thought I was on r/investing.",
            "Always buy the coup the chaebol are at damn near Illuminati levels.",
            "i love how OP thinks we value his opinion",
            "not trying to be rude but you made 12%.. congrats thats great i guess",
            "CPNG"
        ],
        "created_at": "2025-03-17 15:02:58",
        "url": "https://i.redd.it/92j9pljsqape1.png"
    },
    {
        "title": "100k on German Metal or Something I Dunno",
        "text": "",
        "id": "1jdke0d",
        "upvotes": 231,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 86 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Succesfully bought the top",
            "top signal",
            "I too buy stocks after they triple in value in a month",
            "Du hast",
            "Bisschen late to the party oder du fetter verblödeter amerikanischer Vollhorst?!",
            "I thought you Americans were saying we should fund our own defence? Buy some LMT instead!",
            "In Germany we say: Macher",
            "Certified regard.\n\n!remindme 1 Month\n\nEdit:  I belong in this sub",
            "I once held 10 shares of Rheinmetall at €80 and sold around €150\n\nBut this, this seems . . . \n\nYou know what, still better than American defense firms. Good buy."
        ],
        "created_at": "2025-03-17 14:48:37",
        "url": "https://i.redd.it/ucpqcje1qape1.jpeg"
    },
    {
        "title": "Bought the dip 90k in ibit calls",
        "text": "sbrrr ",
        "id": "1jdixjl",
        "upvotes": 21,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 6 years ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Andddd it's gone",
            "What dip...? Lol",
            "Next time you should buy the dippier dip",
            "Very scary, good luck.",
            "There is a tremendous dip in coming!\nYou don't see?",
            "I dont see any dip 🤷‍♂️",
            "Check out my red pnl"
        ],
        "created_at": "2025-03-17 13:50:59",
        "url": "https://i.redd.it/qukpyo1rfape1.jpeg"
    },
    {
        "title": "Failed puts",
        "text": "Held over the weekend, theta cooked me all profits I made last week gone in a blink holding onto hopium they’ll pay out tomorrow. But might cut losses today eod",
        "id": "1jdhy56",
        "upvotes": 63,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 4 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Wealthsimple regard paying $2 per contract fee as well, I do the same![img](emote|t5_2th52|4271)",
            "#Rule 1: Never buy puts with money you can’t afford to lose. \n\nIf you’re worried about losses buy stocks and inverse ETFs which have linear risk.",
            "Canadian regards love blowing up TFSAs. GG",
            "I feel like some basic technicals would have improved your risk analysis a little. Okay so we went into a 10% correction, bottomed out money flow indicator and rsi. bounce develops, it's not on strong volume, today doesn't look like it is either, the 200 day is not very far away, if you're looking to get short you want to see a rejection off of that which is going to line up with some kind of bearish reaction to what Powell says. \n\nThere still is no follow-through on the rally, just a retracement at this point. Like we have to see how it trades but it looks pretty likely the Fed is going to set near term direction with either a breakout rally or a breakdown and if we get a break down it's almost certainly going to line up with some type of rejection off the 200 day which is actually really not a good sign at all. Between that and talk of reciprocal tariffs you could open the door to the 520 area on spy.",
            "Why are you gambling in your tfsa",
            "Noice. When are you planning to live out of your car?",
            "Riperino",
            "nice job bro!!!",
            "You belong here"
        ],
        "created_at": "2025-03-17 13:12:01",
        "url": "https://i.redd.it/e55cy9us8ape1.jpeg"
    },
    {
        "title": "You never know when a recession is coming… but there will be signs.",
        "text": "",
        "id": "1jdh147",
        "upvotes": 4959,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 243 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "You know what though? Forget all this stock stuff. Imagine 10k in redeemable Wendy’s rewards 🤑",
            "Keep that app installed. You can apply right from it.",
            "One strong recession indicator is the Stripper index. Apparently strip clubs go dry months in advance of recessions.\n\nSource: a local stripper I know. She asked me to see her at work a few weeks ago and it was half dead on a Friday night.",
            "\"Sir, this is a Wendy's\"",
            "https://preview.redd.it/71fl757k9ape1.jpeg?width=2048&format=pjpg&auto=webp&s=aa46a5d9a3fc2b9b49a7d8323794e3f75678ba02\n\n*There’s still time.*",
            "Does Wendy’s offer adjustable rates?",
            "Thin Mint frosty sounds really good though",
            "Saying no one knows if a recession is coming ignores the fact that people make tons of money each recession by seeing signs that others ignore.",
            "DD tag ![img](emote|t5_2th52|4271)"
        ],
        "created_at": "2025-03-17 12:35:27",
        "url": "https://i.redd.it/vhv3bc3a2ape1.jpeg"
    },
    {
        "title": "$OSCR - FULL PORT $600K Earnings run up YOLO",
        "text": "$OSCR is an easy play. Earnings are expected to be on May 6th. Going to play the run up to earnings. \n\nHas all the right characteristics. Michael Burry is holding with a cost basis $13.44.\n\nAlso, Josh Kushner - ties to the Trump family - recently purchased \\~$20 million worth of shares , marking the first insider purchases on OSCR by Kushner (or anyone else) since 2021.\n\nNot sure how they don't beat.\n\nI have 48,000 shares at a basis of $13.07\n\nhttps://preview.redd.it/95291gjvs9pe1.png?width=900&format=png&auto=webp&s=7ef082acb4d1b2554808412b62887b177402854e\n\n",
        "id": "1jdfue1",
        "upvotes": 99,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 27 | **Previous Best DD** | \n**Account Age** | 8 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "The next intel guy",
            "Kushner is also the one who founded the company",
            "Narrator— OP didn’t go full port. He just went some port.",
            "Im in with an amount of money I can not afford to lose",
            "Michael Burry responded to my craigslist ad looking for someone to mow my lawn. \"$30 is $30\", he said as he continued to mow what was clearly the wrong yard. My neighbor and I shouted at him but he was already wearing muffs. Focused dude. He attached a phone mount onto the handle of his push mower. I was able to sneak a peek and he was browsing Zillow listings in central Wyoming. He wouldn't stop cackling.\n\nThat is to say, Burry has his fingers in a lot of pies. He makes sure his name is in all the conversations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "Well there goes my $500 i have left ![img](emote|t5_2th52|8883)",
            "High volume options in may for $18. Might have to",
            "I am also long and have made money on OSCR.\n\nIt is profitable and forward PE is good.\n\nLow debt too.\n\nFCF growing.",
            "Chad. Good luck OP 👊🏼"
        ],
        "created_at": "2025-03-17 11:47:51",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jdfue1/oscr_full_port_600k_earnings_run_up_yolo/"
    },
    {
        "title": "Monday = depression = recession indicator",
        "text": "",
        "id": "1jdf2in",
        "upvotes": 3918,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 512 | **Previous Best DD** | \n**Account Age** | 3 weeks | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Calls on hot water companies",
            "Sold most all of my volatile stocks this morning hoping prices would crash but now they're back to where I sold them at lol",
            "Pack your bags son, I lost the house",
            "you guys have showers?",
            "OP you just need to hold and think back upon this meme in a couple of months crying even harder when you could have sold instead of making this meme",
            "It’s literally Monday my dudes",
            "I was 50 procent up before the tarrifist",
            "Paper hands all around",
            "I once told my grandfather he should invest in gamefreak, just as pokemon was becoming popular.  We're talking the announcement of red and blue for the US market.    \nI was very young.  \n\nHe chuckled.  He didn't buy."
        ],
        "created_at": "2025-03-17 11:16:22",
        "url": "https://i.redd.it/4c5vtg46o9pe1.jpeg"
    },
    {
        "title": "$AAPL 70k play",
        "text": "Tariffs are gonna reverse, Tim is gonna cook and Apple is gonna be back. What other DD do you need on the greatest stock to ever exist, and that’s a fucking fact.",
        "id": "1jdf0i0",
        "upvotes": 60,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 973 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Thanks, bought puts.",
            "thank god these are far out",
            "Man, all the mag7 stocks are going to print tendies or take down the entire stock market with them.",
            "God why is apple $210?\n\nJesus i swear i blinked it was at 250 not long ago",
            "I don’t think tariffs will reverse",
            "Buy shares don’t play timing this because there are so many things that can influence, Apple will eventually rise again just buy n chill.",
            "Im eyeing 205c 6/20",
            "Sell some otms to the degens",
            "This guy fcks"
        ],
        "created_at": "2025-03-17 11:14:06",
        "url": "https://i.redd.it/ld5rksern9pe1.jpeg"
    },
    {
        "title": "KNT.TO just released monster earnings. Low IV now. Rally all week easy win.",
        "text": "KNT gold mining company just released huge record earnings this morning. Q4 cash flow USD $72 million, EBITDA $0.35 per share. With growth to continue through this year as an expansion ramps up in Q2. Gold has also risen an additional $250/oz since.\n\n$72 million x4= $288mil cash flow. Convert to CAD is $412mil. KNT.TO currently has a $2.7 billion market cap. It’s trading at a mere 6x cash flow. This isn’t factoring future production at a now higher gold price, this would add an additional $15mil/quarter cash flow.\n\nI think now that earnings are released and as market processes them KNT will go on a run all week to $13-14 range. IV has dropped and option premiums are dirt cheap. As I write this you can buy ITM $11 calls for $.45, only $0.08 premium. A run to $13 will 4x your money.\n\nMy position is:\n2k shares\n30 calls at $10 March\n10 calls $11 March\n10 calls $12 April",
        "id": "1jdeywy",
        "upvotes": 2,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 618 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/qit0w7/did_you_miss_the_v_shape_covid_recovery_resulting/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "You want me to pump your bags Brodie?",
            "Mining stocks are boomer cryptocurrency",
            "Hmmm",
            "You should go ahead and zoom out. Exit liquidity is you.",
            "Hmmm",
            "I’m up 2x, 3x and 80% on my calls Brodie. Its going up anyway sharing the wealth info"
        ],
        "created_at": "2025-03-17 11:12:16",
        "url": "https://www.reddit.com/gallery/1jdeywy"
    },
    {
        "title": "i love shorting",
        "text": "https://preview.redd.it/d1dd9z2si9pe1.png?width=3512&format=png&auto=webp&s=1e6b0af34ae40b74247e359d5e9f854afd198be4\n\nit feels so good not to have any responsibility attached to a virtual stock simulator ",
        "id": "1jded1b",
        "upvotes": 54,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Eat my shorts",
            "Bro is going to get his account balance deleted.",
            "You're posting paper trading screenshots?",
            "I love sharting",
            "shorting became easy money especially on tesla",
            "I too love snorting",
            "these are all long positions ?\n\nor does it not show up as a negative QTY ?\n\nedit: it doesn't ig, thats a pretty weird design choice\n\noverall its a good choice to short quantum, pretty volatile though so need to manage margin carefully",
            ">no responsibility \n\nThat's how you get margin called."
        ],
        "created_at": "2025-03-17 10:46:37",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jded1b/i_love_shorting/"
    },
    {
        "title": "We live to see another day at the casino",
        "text": "Took 8500 out for the wife! Then went full send with ODTE puts after the pump! Good day everyone! ",
        "id": "1jddg4u",
        "upvotes": 211,
        "comments": [
            "Show when you bought it. Exactly 20k is sus as fuck",
            "You risked 85k+ on a 0dte 💀",
            "On a 5 % battery. Damn you live life on the edge",
            "what a sniper",
            "tslq doing great today",
            "![img](emote|t5_2th52|4258)",
            "Jacked to the tits.",
            "Congrats op what a gain",
            "Howd you time that top? Or just a guess",
            "What asniper"
        ],
        "created_at": "2025-03-17 10:06:19",
        "url": "https://i.redd.it/2jikg24ob9pe1.jpeg"
    },
    {
        "title": "Robinhood adds prediction market",
        "text": "this sh",
        "id": "1jdcbo1",
        "upvotes": 268,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 78 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "“Robinhood added that eligible customers will also be able to bet on the results of the upcoming men’s and women’s college basketball tournaments.”\n\nGo forth and lose more money faster my young regards.",
            "Not even going to read it.\n\nSummary: ![img](emote|t5_2th52|4271)",
            "now literally a casino ![img](emote|t5_2th52|4271)",
            "Wall Street….  Bets? ![img](emote|t5_2th52|12787)",
            "Any word on when DraftKings is going to open a brokerage?",
            "PARLAY OPTIONS![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)",
            "Why pretend it isn't a casino when you can just make it a casino? \n\n\nI'm gonna wait 2-3 years when all the money is in the prediction market and all stocks are flat and everyone's just waiting for 1 random guy to buy or sell 1 share to make the ticker move. ",
            "\"Prediction market\" is a nice new term for outright gambling. Give that marketing team a bonus",
            "Derivatives for sports betting when"
        ],
        "created_at": "2025-03-17 09:13:38",
        "url": "https://finance.yahoo.com/news/robinhood-expands-betting-footprint-prediction-130126288.html"
    },
    {
        "title": "Retail sales data comes in weaker than expected",
        "text": "",
        "id": "1jdc10v",
        "upvotes": 1548,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 33 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Bad news? Should pump the market!",
            "Everyone is broke and nobody is hiring. New ATH inbound! ![img](emote|t5_2th52|4276)",
            "bad data = minor pump\n\ngood data = mega pump",
            "Consumers have less to spend? That means rich people have even more money to buy stocks.\n\nCalls it is!",
            "Millennials have stopped buying their 11 dollar lattes. We're fucked.",
            "Oh wow...\nThats sooooooooooooooo surprising....\n\nWho would or could have ever guessed these numbers would be down??!?!?\n\nAnd the markets are red, right? Because sales are how companies make profits and that's what makes stocks valuable....\nThe market is red, right?",
            "Believe it or not, calls",
            "If you spell winning backwards, you get retard",
            "End of the month GDP figures are going to absolutely bend the markets over."
        ],
        "created_at": "2025-03-17 08:59:03",
        "url": "https://www.cnn.com/2025/03/17/economy/us-retail-sales-february/index.html"
    },
    {
        "title": "Daily Discussion Thread for March 17, 2025",
        "text": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1jd903u)",
        "id": "1jd903u",
        "upvotes": 230,
        "comments": [
            "I can't believe that when I was a kid I wanted to grow up.   What the fuck was wrong with me?",
            "Good news = 🚀🚀🚀\n\nBad news = 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
            "#BREAKING: STOCKS RALLY AS ‘THINGS COULD BE WORSE’",
            "She's a 10 but thinks time in the market beats timing the market",
            "Tesla’s social sentiment is cooked. \n\n“Omg bro stay off Reddit lmao in the real world it’s not like that”\n\nIn the real world people are firebombing them, driving them into lakes, spraying painting and keying.",
            "Did Elon think conservatives would give up their diesels for EVs ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
            "4 word horror stories:\n\nWife found brokerage history.",
            "I need you guys to stop fear mongering\n\nwe are not in a trade war\n\nwe are in a special economic operation",
            "will these puts print? yes, but the literal day after yours expire.",
            "I just ran the numbers and realized I have a severe trade deficit with my favorite grocery store. They’re taking advantage of me and I’m not going to stand for it any longer"
        ],
        "created_at": "2025-03-17 05:57:31",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jd903u/daily_discussion_thread_for_march_17_2025/"
    },
    {
        "title": "Is HIMS cooked?",
        "text": "",
        "id": "1jd6l7y",
        "upvotes": 252,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 367 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Dick shrinkage is where i draw the line",
            "It was a bigger hit when semaglutide was removed from the shortage list.\n\nSides of fin have been known for years.",
            "Paywalled, what happened to the guys who took it? Does their junk still work?",
            "Huh, my genitals shrank and changed shape… I should probably continue taking these pills that are intended to mess with my male hormones.",
            "Any drug has side effects, and every fucking credible study shows that finasteride has a low risk profile.   \n  \nPUTS because people are retarded and will believe anything",
            "Anyone taking finestride without knowing about the sides is a special type of stupid.",
            "Not Mr. Milchick",
            "That's just one of the typical finasteride side effects. If you're one of the unlucky one with side effects, cut it. Pretty simple..",
            "Doing a great job with marketing - both Hims & Hers. Mail order Pharma is going to be huge with Gen Z - already big with Millennials."
        ],
        "created_at": "2025-03-17 02:49:11",
        "url": "https://www.wsj.com/health/pharma/telehealth-hims-hair-loss-finasteride-side-effects-0bc5992f"
    },
    {
        "title": "South Korea Says No to Bitcoin in Foreign Reserve",
        "text": "",
        "id": "1jd63zt",
        "upvotes": 4002,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Yeah but don’t they know everything’s computer?",
            "[North Korea Now Third Largest Bitcoin Holder](https://www.binance.com/en/square/post/21634593578610)\n\n[https://www.binance.com/en/square/post/21634593578610](https://www.binance.com/en/square/post/21634593578610)",
            "Where does SK rank in education?\n\nOh, number fucking 1.",
            "Any country who signs on with the US needs to understand they are going to get their entire Treasury rugpulled\n\n\nI thought this wasn't the 1890's",
            "Bitcoin is a vehicle for speculation, not a reserve currency.",
            "What are you saying. SK actually has an adult in the room?",
            "Everything's computer tho",
            "First it was crypto affecting computer hardware consumer prices then it the sheer electricity usage was affecting climate change and now its literally keeping nuclear 3rd world countries thriving due to all the hack stealing. \n\nI think everybody agrees crypto has only benefited a select few while being an overall negative for humanity.",
            "BTC is thescam of the century"
        ],
        "created_at": "2025-03-17 02:12:47",
        "url": "https://www.blockhead.co/2025/03/17/south-korea-says-no-to-bitcoin-in-foreign-reserve/"
    },
    {
        "title": "The struggle is real",
        "text": "",
        "id": "1jd4ozd",
        "upvotes": 4233,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 2364 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "take out the left 3 horses and that's me",
            "Every morning when I wake up, I check the news to see the new horsies they added.",
            "Dark pools  \nEggs crisis  \nShitty weather  \nHigh pressure",
            "https://preview.redd.it/6oqyi1pll6pe1.jpeg?width=714&format=pjpg&auto=webp&s=03a36bf4a44a8b5753e19b9084387ba6c5e45e4a",
            "orange monday is coming ![img](emote|t5_2th52|4275)",
            "cocaine horse, the follow-up movie to cocaine bear",
            "Jokes on you\n\nI no longer trade dollars\n\nI trade dolla\n\nHONG KONG DOLLA",
            "Cash gang and chill",
            "Being a bull is way easier than being a bear. Bears need to know which stocks will go down, and it’s harder to predict when a stock will go down than when it will go up. They usually get their big break during a bear market like what we have now.\n\n\nA bear market is arguably better for bulls because it’s when most really good stocks are selling for a huge discount because of short term panic. A good stock always recovers its price even after the worst bear markets. Buy low sell high."
        ],
        "created_at": "2025-03-17 00:36:50",
        "url": "https://i.redd.it/a8beidi2i6pe1.jpeg"
    },
    {
        "title": "Fast-Fashion Forever 21 Operator Goes Bankrupt Again",
        "text": "An operator of some retail stores of Forever 21, a brand that once attracted droves of young women and girls to shop for cheap, trendy clothing, filed for bankruptcy after years of poor performance. \n\n[a  of shit about it being super indebted and how retailers are having difficulties, and then the relevant part to stocks]\n\nA group of buyers — including Simon Property Group, Brookfield Corp. and Authentic Brands — teamed up to buy Forever 21 out of bankruptcy through a venture called Sparc Group. Sparc announced this year it was combining with JCPenney to form Catalyst Brands. At the time of the merger, Catalyst said it was exploring strategic options for the operations of Forever 21.\n",
        "id": "1jd45pi",
        "upvotes": 755,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 2751 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Good, they should go out of business because  they're filthy liars. \n\nI know not a single person who went shopping there and then stayed 21 forever.",
            "Forever Chapter 11",
            "I feel like Shein killed them",
            "Peaked in high school",
            "In Asia, Uniqlo and Shein completely obliterated Forever 21.",
            "Now it’s Forever Closed",
            "This is why private equity companies should technically be illegal, because the money they spend to buy the company is then put as a debt on that company's books, which they will almost always later file bankruptcy because the private equity group will refuse to invest in the company to keep things updated and growing.",
            "I can't wait til i'm old enough to go bankrupt twice.",
            "well looks like i have to find cheap men clothing elsewhere."
        ],
        "created_at": "2025-03-17 00:03:39",
        "url": "https://www.bloomberg.com/news/articles/2025-03-17/fast-fashion-forever-21-operator-goes-bankrupt-again"
    },
    {
        "title": "My black swan has her wings - LMT into the toilet make puts go BOOM!",
        "text": "ETA: My thesis applies to LMT for the period from 3/17/25 through end of May 2025. More or less an earnings play but I'm not sure if the drop will be before, on or after earnings.\n\nETA: some additional context at the bottom of the post that address legitimate questions that I think I can answer from comments\n\nETA: Updated my position to reflect adding another put option. To me on this day (3/17/2025) the market seems like it wants to keep trading back up to test 5737, maybe as high as 5809, before we see the next leg down. So I will add more as we approach those levels.\n\n\\-------------------------------------\n\nI could write a separate post about why I think we are about to experience a black swan event (or really a black swan period) and I'm not sure if this particular point I am going to discuss will cause it. Either way there is a ton of money to be made on LMT in the next few hours / days / weeks or months.\n\nHard to know exactly when the market will realize just how much POTUS has fucked up LMT's business and then from there I don't know if the market will immediately see the contagion risk for other US defense companies. It may take some time for this to sink in, not sure.\n\nOk so about LMT - Lockheed Martin is a defense contractor. The big thing to know for this is that they make the most expensive and capable fighter aircraft (war plane for shooting down other planes and/or dropping bombs) in the world. There are huge reliability and quality issues but end of the day nothing for sale by any company on the planet can beat it and nations across the globe (Canada, UK, Germany, many other nations across Europe, etc.) have placed orders ranging from a few billion dollars to hundreds of billions for F35 aircraft and after acquisition support and maintenance. The purchase price is roughly **$125,000,000** each (I'm not sure if that includes maintenance and support, I think maybe just support but there would be additional significant amounts of money going to LMT for maintenance over time).\n\nWith hundreds of billions of dollars of orders on the books, many more statements of intent from nations like Portugal, Turkiye, etc. and the associated revenue streams from maintenance, ammunition, etc. LMT has been looking pretty great since Russia's 2022 invasion of Ukraine which sent nations across the globe scrambling to buy the bets military tech they could afford.\n\nBut that brings us to today. Where things are suddenly changing drastically and in ways that are likely not reversible, at least not in any reasonable timeframe. The market hasn't yet priced this in and I don't know exactly when that will happen. Could be during the April earnings release. Could be tomorrow when trading begins. Could be anytime between now and then.\n\nSee the thing is; when you are a nation that has managed to pull together a couple of billion dollars to buy military aircraft that you intend to use for the next 20, 30 maybe even 40 years, you tend to really think through the decision. There are many factors involved; not the least of which is how reliant are you on the manufacturer (and the nation that manufacturer is based in) for support and maintenance.  Obviously if you can bring support and maintenance to your own nation then the dollars spent at least stay in your own country however that isn't always possible, especially with cutting edge top of the line systems, like the F35. Anyone who owns and operates the F35 platform will need unfettered access to LMT resources and specialists in order to get anywhere close to 100% of the benefit you might expect to get from having these in your air force. Just keeping them flying without access to LMT might prove impossible, let alone using all the fancy bells and whistles which in some cases rely on access to US military satellites in orbit.\n\nThe other piece to this puzzle is that these planes take A LONG time to build. Canada ordered 88 planes for about $9,000,000,000 back in 2023 and they are expected to get their first batch of 16 sometime next year. And they have only paid for those first 16 so not much they can do about that. But there are 72 F35 planes at roughly $125,000,000 a pop that they haven't paid for but LMT has in their order books. This is Canada I'm speaking about, the nation that POTUS keeps insisting will become part of the USA (whether they want to or not) and has been using economic extortion to try and extract trade concessions. That already made the idea of buying these additional 72 plans dicey but then you had POTUS suddenly cancel all military maintenance and support contracts between US defense contractors and Ukraine. This was walked back a bit but it made everybody sit up and think about the fact that POTUS was so mercurial that the idea of buying incredibly expensive weapons that could be hobbled on the word of POTUS maybe isn't the best idea.\n\nSince close of market on Friday the following has happened:\n\n1. The nation of Portugal (which had previously said they intended to buy some F35s) has announced they will look for alternatives that are manufactured in Europe. These aren't firm orders but they do represent part of the potential customer based for the F35.\n2. Then Turkiye, who has wanted to purchase the F35 for years and was prevented from doing so due to some geopolitical stuff announced that they would buy 40 fighter aircraft from the UK. Now these planes aren't nearly as good (or expensive as the F35) however the idea that Turkiye would invest what will end up being hundreds of millions of dollars into aircraft that aren't F35s and more importantly aren't from their usual military aircraft supplier (the USA) means that any future plans to purchase the F35 is now in doubt.\n3. Canada has now announced they intend to look for alternatives to the F35 instead of moving forward with the purchase of an additional 72 planes. I don't know if this will mean they are breaking a contract or maybe it is just rescinding a statement of intent. That is a question I don't have the answer to at the moment but it really doesn't matter. These were sales that are currently reflected in the LMT stock price that are now, for all intents and purposes, cancelled.\n\nSo that is my play - I am going to be buying more puts on LMT to add to what I already have over time (current position below)\n\nETA: Picked up June 20th $400P x1 on 3/17/2025\n\nhttps://preview.redd.it/8sccerz7s5pe1.png?width=1229&format=png&auto=webp&s=550517e5f82379d8e6f412d617ccb9a12bd68505\n\nI was already expecting a complete market crash as a result of POTUS' choices and actions. I've made some nice money in the last three weeks as a result. However I think we are just getting started and SOMETHING is going to lead to a bear market, possibly a depression. This thing with LMT could be the black swan that does it because when the market realizes the above is the reality of the situation there is a logical next thought: what about OTHER platforms and systems, whether made by LMT or other US defense contractors.\n\nBuying Patriot air defense systems or already own some and think you might need to buy some ammunition? Maybe time to look around at diversifying your supplier for anti aircraft and anti missile systems in case POTUS decides he doesn't like you.\n\nWhat about new tanks and armored transports? Probably not the kind of thing that relies as heavily on the manufacturer but spare parts and software updates will still be needed and if you have to switch to another supplier for additional vehicles down the road you will now have multiple platforms in operation which complicates logistics, training and operations, tactical operations, etc. That can impact decision making on new purchases.\n\nNaval vessels? Advanced radar systems to use on the weapons platform (that flies, drives or sails) which you are purchasing from a different manufacturer? These are the most complex technical systems on the planet and often have components from different manufacturers. LMT might make the plane but it uses things made by RTX and other defense companies.\n\nAnd this isn't something that you can easily fix. POTUS can promise to be nice and stay on his best behavior.... which I don't think he would even be willing to say let alone follow through on. But even if he did say it are militaries around the world going to want to have to rely on that? Can they risk having their nation's ability to defend itself hinge on the good will of someone who could favorably be described as inconsistent?\n\nI don't know if the collapse of the US defense sector will lead to a complete market crash. But I think it has a chance. Either way I'm confident something will do that and in the mean time LMT puts seem rife with opportunity at the moment.\n\nETA:\n\nThe USA is the biggest customer for the US arms industry, \\~70% of LMT's customers are right here in the USA:\n\nIn terms of my specific DD for this specific arms manufacturer at this specific moment in time - LMT is currently filling orders on what is the most expensive defense production run in human history. It is valued at over a trillion dollars for the life of the platform (from development, through production and to the end of post production support such as spare parts, software updates and maintenance). The vast majority of that mammoth expense was shouldered by the USA and funded design, development and early production. The plan originally was for many additional nations to place orders to meet per unit cost targets. But the system was just too expensive and there was actually a bit of a crisis from the early 2000's up until 2022 because the USA was basically the \\*only\\* customer which meant the entire cost of the project was on the USA. Then Russia invaded Ukraine and started doing war crimes in full view of satellites. Canada who had been on the fence for years suddenly ordered 88. The UK massively upped their order. A bunch of other nations in Europe and beyond placed or expanded orders and the cost per unit has plunged. All to say that the last 10 years have been all USA and the next 10 years were supposed to be mostly Europe, Middle East, South Asia, South East Asia, Australia/NZ, etc.\n\nAlso in general I am very bearish on many industries in the USA including defense\\*\n\n\\* [https://www.cnbc.com/2025/02/13/defense-stocks-drop-after-trump-says-defense-spending-could-be-halved.html](https://www.cnbc.com/2025/02/13/defense-stocks-drop-after-trump-says-defense-spending-could-be-halved.html)",
        "id": "1jd2b7h",
        "upvotes": 411,
        "comments": [
            "# **TLDR**\n---\n**Ticker:** LMT\n**Direction:** Down\n**Prognosis:** Buy Puts\n**Reason:** POTUS is fucking up LMT's international sales, potentially causing a black swan event.  Countries are reconsidering F-35 purchases due to concerns over US reliability and POTUS's unpredictability.\n**Bonus:** OP is already up nicely on puts and is expecting a larger market crash.  Diversify your weapons suppliers!",
            "I had the same idea, the problem is everyone knows what you just said. The trade was the short from 600. When everyone knows what you just posted and how much more is really left in the tank? \n\nYou could position for a reduction in defense spending but the only way to really trade this is short the shares. Buying puts, the theta is going to be terrible\n\nThere's also not really a great level to manage risk off on the share short",
            "I think you think this is a highly technical post.  It is not.",
            "The issue is LMT goes up when there is war announcement. Thats what happened last year during Israel crisis. While Europe and Canada are pissed other countries are trying to comply or negotiate. I dont think everyone will ditch LMT all together. With Donny announcing plans to invade Greenland, Panama etc LMT might get more business and share can go up.",
            "!RemindMe 6 months",
            "According to the internet, 73% of the monies LMT gets is from the US goverment. Did you take this into account?",
            "Can’t be a black swann anymore if you have a whole write up here",
            "LMT has about as big of a mote as you can get…. Maybe they have a rocky patch, but the US government being their biggest client will ensure its profitability for the foreseeable future. \n\nAlso going to an escalated international environment. looks more like China will invade Taiwan.  \n\nHopefully you get lucky on some puts that pay.",
            "Buying calls",
            "Puts on the US defense sector and LMT is beyond regarded. What's next shorting McDonald's and French fries?"
        ],
        "created_at": "2025-03-16 22:21:36",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1jd2b7h/my_black_swan_has_her_wings_lmt_into_the_toilet/"
    }
]